Rokasbarasa1/STM32-Quadcopter/src/main.c
    // Pitch (+)forwards - front of device nose goes down
    // Roll (+)right - the device banks to the right side while pointing forward
    // After yaw calculation yaw has to be 0/360 when facing north in the pitch+ axis
    // After getting roll and pitch from accelerometer. Pitch forwards -> +Pitch. Roll right -> +Roll
    rotate_magnetometer_output_90_degrees_anti_clockwise(magnetometer_data);
    invert_axies(acceleration_data);
    invert_axies(gyro_angular);
    // Pitch device forwards -> Y axis positive. Roll device right -> X axis positive
    // ------------------------------------------------------------------------------------------------------ Filter the sensor data
    sensors6 = DWT->CYCCNT;

    // Notch filter: https://www.youtube.com/watch?v=ysS4bIXFAsU
    // Filtering rpm: https://www.youtube.com/watch?v=NCDyA9bnf4I&t=192s


    // Max 1.79. Without 1.46
    // RPM filtering
    if(motor_frequency[0] >= rpm_notch_filter_min_frequency){

        // 1st harmonic
        if(motor_frequency[0] < nyquist_with_margin &&
            motor_frequency[1] < nyquist_with_margin &&
            motor_frequency[2] < nyquist_with_margin &&
            motor_frequency[3] < nyquist_with_margin
        ){
            notch_filter_q_set_center_frequency(&gyro_x_notch_filter_harmonic_1_motor_0, motor_frequency[0]);
            notch_filter_q_set_center_frequency(&gyro_x_notch_filter_harmonic_1_motor_1, motor_frequency[1]);
            notch_filter_q_set_center_frequency(&gyro_x_notch_filter_harmonic_1_motor_2, motor_frequency[2]);
            notch_filter_q_set_center_frequency(&gyro_x_notch_filter_harmonic_1_motor_3, motor_frequency[3]);
            notch_filter_q_set_center_frequency_using_reference_filter(&gyro_y_notch_filter_harmonic_1_motor_0, &gyro_x_notch_filter_harmonic_1_motor_0);
            notch_filter_q_set_center_frequency_using_reference_filter(&gyro_y_notch_filter_harmonic_1_motor_1, &gyro_x_notch_filter_harmonic_1_motor_1);
            notch_filter_q_set_center_frequency_using_reference_filter(&gyro_y_notch_filter_harmonic_1_motor_2, &gyro_x_notch_filter_harmonic_1_motor_2);
            notch_filter_q_set_center_frequency_using_reference_filter(&gyro_y_notch_filter_harmonic_1_motor_3, &gyro_x_notch_filter_harmonic_1_motor_3);

            gyro_angular[0] = notch_filter_q_read(&gyro_x_notch_filter_harmonic_1_motor_0, gyro_angular[0]);
            gyro_angular[0] = notch_filter_q_read(&gyro_x_notch_filter_harmonic_1_motor_1, gyro_angular[0]);
            gyro_angular[0] = notch_filter_q_read(&gyro_x_notch_filter_harmonic_1_motor_2, gyro_angular[0]);
            gyro_angular[0] = notch_filter_q_read(&gyro_x_notch_filter_harmonic_1_motor_3, gyro_angular[0]);

            gyro_angular[1] = notch_filter_q_read(&gyro_y_notch_filter_harmonic_1_motor_0, gyro_angular[1]);
            gyro_angular[1] = notch_filter_q_read(&gyro_y_notch_filter_harmonic_1_motor_1, gyro_angular[1]);
            gyro_angular[1] = notch_filter_q_read(&gyro_y_notch_filter_harmonic_1_motor_2, gyro_angular[1]);
            gyro_angular[1] = notch_filter_q_read(&gyro_y_notch_filter_harmonic_1_motor_3, gyro_angular[1]);
        }

        // 2nd harmonic (Not used as its not visible)
        // if(motor_frequency[0] * 2 < nyquist_with_margin &&
        //     motor_frequency[1] * 2 < nyquist_with_margin &&
        //     motor_frequency[2] * 2 < nyquist_with_margin &&
        //     motor_frequency[3] * 2 < nyquist_with_margin
        // ){
        //     notch_filter_q_set_center_frequency(&gyro_x_notch_filter_harmonic_2_motor_0, motor_frequency[0] * 2);
        //     notch_filter_q_set_center_frequency(&gyro_x_notch_filter_harmonic_2_motor_1, motor_frequency[1] * 2);
        //     notch_filter_q_set_center_frequency(&gyro_x_notch_filter_harmonic_2_motor_2, motor_frequency[2] * 2);
        //     notch_filter_q_set_center_frequency(&gyro_x_notch_filter_harmonic_2_motor_3, motor_frequency[3] * 2);
        //     notch_filter_q_set_center_frequency_using_reference_filter(&gyro_y_notch_filter_harmonic_2_motor_0, &gyro_x_notch_filter_harmonic_2_motor_0);
        //     notch_filter_q_set_center_frequency_using_reference_filter(&gyro_y_notch_filter_harmonic_2_motor_1, &gyro_x_notch_filter_harmonic_2_motor_1);
        //     notch_filter_q_set_center_frequency_using_reference_filter(&gyro_y_notch_filter_harmonic_2_motor_2, &gyro_x_notch_filter_harmonic_2_motor_2);
        //     notch_filter_q_set_center_frequency_using_reference_filter(&gyro_y_notch_filter_harmonic_2_motor_3, &gyro_x_notch_filter_harmonic_2_motor_3);

        //     gyro_angular[0] = notch_filter_q_read(&gyro_x_notch_filter_harmonic_2_motor_0, gyro_angular[0]);
        //     gyro_angular[0] = notch_filter_q_read(&gyro_x_notch_filter_harmonic_2_motor_1, gyro_angular[0]);
        //     gyro_angular[0] = notch_filter_q_read(&gyro_x_notch_filter_harmonic_2_motor_2, gyro_angular[0]);
        //     gyro_angular[0] = notch_filter_q_read(&gyro_x_notch_filter_harmonic_2_motor_3, gyro_angular[0]);

        //     gyro_angular[1] = notch_filter_q_read(&gyro_y_notch_filter_harmonic_2_motor_0, gyro_angular[1]);
        //     gyro_angular[1] = notch_filter_q_read(&gyro_y_notch_filter_harmonic_2_motor_1, gyro_angular[1]);
        //     gyro_angular[1] = notch_filter_q_read(&gyro_y_notch_filter_harmonic_2_motor_2, gyro_angular[1]);
        //     gyro_angular[1] = notch_filter_q_read(&gyro_y_notch_filter_harmonic_2_motor_3, gyro_angular[1]);
        // }

        // 3nd harmonic
        if(motor_frequency[0] * 3 < nyquist_with_margin &&
            motor_frequency[1] * 3 < nyquist_with_margin &&
            motor_frequency[2] * 3 < nyquist_with_margin &&
            motor_frequency[3] * 3 < nyquist_with_margin
        ){
            notch_filter_q_set_center_frequency(&gyro_x_notch_filter_harmonic_3_motor_0, motor_frequency[0] * 3);
            notch_filter_q_set_center_frequency(&gyro_x_notch_filter_harmonic_3_motor_1, motor_frequency[1] * 3);
            notch_filter_q_set_center_frequency(&gyro_x_notch_filter_harmonic_3_motor_2, motor_frequency[2] * 3);
            notch_filter_q_set_center_frequency(&gyro_x_notch_filter_harmonic_3_motor_3, motor_frequency[3] * 3);
            notch_filter_q_set_center_frequency_using_reference_filter(&gyro_y_notch_filter_harmonic_3_motor_0, &gyro_x_notch_filter_harmonic_3_motor_0);
            notch_filter_q_set_center_frequency_using_reference_filter(&gyro_y_notch_filter_harmonic_3_motor_1, &gyro_x_notch_filter_harmonic_3_motor_1);
            notch_filter_q_set_center_frequency_using_reference_filter(&gyro_y_notch_filter_harmonic_3_motor_2, &gyro_x_notch_filter_harmonic_3_motor_2);
            notch_filter_q_set_center_frequency_using_reference_filter(&gyro_y_notch_filter_harmonic_3_motor_3, &gyro_x_notch_filter_harmonic_3_motor_3);

            gyro_angular[0] = notch_filter_q_read(&gyro_x_notch_filter_harmonic_3_motor_0, gyro_angular[0]);
            gyro_angular[0] = notch_filter_q_read(&gyro_x_notch_filter_harmonic_3_motor_1, gyro_angular[0]);
            gyro_angular[0] = notch_filter_q_read(&gyro_x_notch_filter_harmonic_3_motor_2, gyro_angular[0]);
            gyro_angular[0] = notch_filter_q_read(&gyro_x_notch_filter_harmonic_3_motor_3, gyro_angular[0]);

            gyro_angular[1] = notch_filter_q_read(&gyro_y_notch_filter_harmonic_3_motor_0, gyro_angular[1]);
            gyro_angular[1] = notch_filter_q_read(&gyro_y_notch_filter_harmonic_3_motor_1, gyro_angular[1]);
            gyro_angular[1] = notch_filter_q_read(&gyro_y_notch_filter_harmonic_3_motor_2, gyro_angular[1]);
            gyro_angular[1] = notch_filter_q_read(&gyro_y_notch_filter_harmonic_3_motor_3, gyro_angular[1]);
        }

        // If the frequencies are above nyquist with margin then filtering is not done
        // If it would be done, the filters would start oscillating the data and work against it at worst
        // or just introduce stronger noise 

