Rokasbarasa1/STM32-Quadcopter/src/main.c
    }
    sensors7 = DWT->CYCCNT;

    // Dynamic notch filtering
    // Not currently used


    // Filter magnetometer data
    magnetometer_data[0] = low_pass_filter_pt1_read(&filter_magnetometer_x, magnetometer_data[0]);
    magnetometer_data[1] = low_pass_filter_pt1_read(&filter_magnetometer_y, magnetometer_data[1]);
    magnetometer_data[2] = low_pass_filter_pt1_read(&filter_magnetometer_z, magnetometer_data[2]);

    // Yaw Angular rotation filtering
    // gyro_angular[2] = low_pass_filter_pt1_read(&filter_gyro_z, gyro_angular[2]);

    acceleration_data[0] = low_pass_filter_pt1_read(&filter_accelerometer_x, acceleration_data[0]);
    acceleration_data[1] = low_pass_filter_pt1_read(&filter_accelerometer_y, acceleration_data[1]);
    acceleration_data[2] = low_pass_filter_pt1_read(&filter_accelerometer_z, acceleration_data[2]);

    sensors8 = DWT->CYCCNT;

    // ------------------------------------------------------------------------------------------------------ Sensor fusion
    calculate_roll_pitch_from_accelerometer_data(acceleration_data, &accelerometer_roll, &accelerometer_pitch, accelerometer_roll_offset, accelerometer_pitch_offset); // Get roll and pitch from the data. I call it x and y. Ranges -90 to 90. 
    sensor_fusion_roll_pitch(gyro_angular, accelerometer_roll, accelerometer_pitch, get_absolute_time(), 1, imu_orientation);

    // Sensor fusion imu degrees > accelerometer degrees
    calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data, &magnetometer_yaw, imu_orientation[0], imu_orientation[1], yaw_offset);

    // No need for sensor fusion, it introduces delay
    imu_orientation[2] = magnetometer_yaw;
    
    sensors9 = DWT->CYCCNT;
    // GPS STUFF
    float latitude_sign = 1 * (bn357_get_latitude_direction() == 'N') + (-1) * (bn357_get_latitude_direction() == 'S'); // Possible results: 0, 1 or -1
    float longitude_sign = 1 * (bn357_get_longitude_direction() == 'E') + (-1) * (bn357_get_longitude_direction() == 'W');
    roll_effect_on_lat = -triangle_cos(imu_orientation[0] * M_PI_DIV_BY_180) * latitude_sign; // + GOOD, - GOOD  // If moving north roll right positive, roll left south negative
    pitch_effect_on_lat = triangle_cos(imu_orientation[1] * M_PI_DIV_BY_180) * latitude_sign; // + GOOD, - GOOD  // If moving north forward positive, backwards negative
    roll_effect_on_lon = triangle_cos(imu_orientation[0] * M_PI_DIV_BY_180) * longitude_sign; // GOOD, - GOOD
    pitch_effect_on_lon = triangle_cos(imu_orientation[1] * M_PI_DIV_BY_180) * longitude_sign; // + GOOD, - GOOD 

    // printf("PLAT: %.2f RLAT: %.2f PLON: %.2f RLON: %.2f\n", 
    //     pitch_effect_on_lat,
    //     roll_effect_on_lat,
    //     pitch_effect_on_lon,
    //     roll_effect_on_lon,
    // );

    // Calculate the in between latitude and longitude to help derivative value
    // if(got_gps){
    //     // Calculate the rate of change of gps at it current refresh rate
    //     delta_gps_latitude = gps_latitude - old_gps_latitude;
    //     delta_gps_longitude = gps_longitude - old_gps_longitude;

    //     // Save the current gps values as old
    //     old_gps_latitude = gps_latitude;
    //     old_gps_longitude = gps_longitude;

    //     in_between_gps_latitude = gps_latitude;
    //     in_between_gps_longitude = gps_longitude;
    //     in_between_gps_loop_divider_counter = 0;
    // }else{
        
    //     // Sometimes the update is skipped on purpose
    //     if(in_between_gps_loop_divider_counter == in_between_gps_loop_divider){
    //         // Update the inbetween
    //         in_between_gps_latitude += delta_gps_latitude * (1.0f/REFRESH_RATE_HZ) * 10;
    //         in_between_gps_longitude += delta_gps_longitude * (1.0f/REFRESH_RATE_HZ) * 10; // Temp times 10 to signify the 10 hz refresh rate of gps

    //         in_between_gps_loop_divider_counter = 0;
    //     }else{
    //         in_between_gps_loop_divider_counter++;
    //     }

    //     // Apply the inbetween 
    //     gps_latitude = in_between_gps_latitude;
    //     gps_longitude = in_between_gps_longitude;
    // }

    sensors10 = DWT->CYCCNT;
    // ------------------------------------------------------------------------------------------------------ Use sensor fused data for more data
    float vertical_acceleration[1] = {mpu6050_calculate_vertical_acceleration_cm_per_second(acceleration_data, imu_orientation)};
    float vertical_altitude[1] = {altitude};

    kalman_filter_predict(&altitude_and_velocity_kalman, vertical_acceleration);
    kalman_filter_update(&altitude_and_velocity_kalman, vertical_altitude);

    altitude = kalman_filter_get_state(&altitude_and_velocity_kalman)[0][0];
    vertical_velocity = kalman_filter_get_state(&altitude_and_velocity_kalman)[1][0];
    sensors11 = DWT->CYCCNT;

    // printf("Alt %f vel %f ", altitude, vertical_velocity);
    // printf("IMU %f %f %f\n", imu_orientation[0], imu_orientation[1], imu_orientation[2]);
}



void handle_pid_and_motor_control(){    
    // For the robot to do work it needs to be receiving radio signals and at the correct angles, facing up
    if(
        // imu_orientation[0] <  30 && 
        // imu_orientation[0] > -30 && 
        // imu_orientation[1] <  30 && 
        // imu_orientation[1] > -30 && 
        ((float)get_absolute_time() - (float)last_signal_timestamp_microseconds) / 1000000.0 <= minimum_signal_timing_seconds
    ){
        // ---------------------------------------------------------------------------------------------- GPS position hold
        float gps_hold_roll_adjustment = 0.0f;
        float gps_hold_pitch_adjustment = 0.0f;
        if(use_gps_hold){
            if(gps_position_hold_enabled && got_gps){
                pid_set_desired_value(&gps_latitude_pid, target_latitude);
                pid_set_desired_value(&gps_longitude_pid, target_longitude);

                error_latitude = pid_get_error(&gps_latitude_pid, gps_latitude, get_absolute_time());
                error_longitude = pid_get_error(&gps_longitude_pid, gps_longitude, get_absolute_time());


                float gps_hold_roll_adjustment_calculation = roll_effect_on_lat * error_latitude + roll_effect_on_lon * error_longitude;
                float gps_hold_pitch_adjustment_calculation = pitch_effect_on_lat * error_latitude + pitch_effect_on_lon * error_longitude;


