Rokasbarasa1/STM32-Quadcopter/src/main.c
            PID_set_points[0] = acro_target_roll; // Logging
            PID_set_points[1] = acro_target_pitch; // Logging
            PID_set_points[2] = acro_target_yaw; // Logging
        }
        

        // Just calculate and not get the error sum. Needed for d term filter
        pid_calculate_error(&acro_roll_pid, gyro_angular[0], get_absolute_time());
        pid_calculate_error(&acro_pitch_pid, gyro_angular[1], get_absolute_time());
        pid_calculate_error(&acro_yaw_pid, gyro_angular[2], get_absolute_time());

        PID_proportional[0] = pid_get_last_proportional_error(&acro_roll_pid);
        PID_integral[0] = pid_get_last_integral_error(&acro_roll_pid);
        PID_derivative[0] = pid_get_last_derivative_error(&acro_roll_pid);
        PID_proportional[1] = pid_get_last_proportional_error(&acro_pitch_pid);
        PID_integral[1] = pid_get_last_integral_error(&acro_pitch_pid);
        PID_derivative[1] = pid_get_last_derivative_error(&acro_pitch_pid);
        PID_proportional[2] = pid_get_last_proportional_error(&acro_yaw_pid);
        PID_integral[2] = pid_get_last_integral_error(&acro_yaw_pid);

        low_pass_filter_biquad_set_cutoff_frequency(
            &roll_d_term_filtering, 
            map_value_to_expo_range_inverted(
                throttle, 
                d_term_filtering_min_cutoff,
                d_term_filtering_max_cutoff,
                d_term_filtering_expo
            )
        ); // Use throttle, not the final output of the motor
        low_pass_filter_biquad_set_cutoff_frequency_using_reference_filter(&pitch_d_term_filtering, &roll_d_term_filtering);

        // Use throttle to make the biquad filter dynamic
        error_acro_roll = PID_proportional[0] + PID_integral[0] + low_pass_filter_biquad_read(&roll_d_term_filtering, PID_derivative[0]);
        error_acro_pitch = PID_proportional[1] + PID_integral[1] + low_pass_filter_biquad_read(&pitch_d_term_filtering, PID_derivative[1]);
        error_acro_yaw = PID_proportional[2] + PID_integral[2];

        motor5 = DWT->CYCCNT;

        // ---------------------------------------------------------------------------------------------- Throttle
        error_throttle = throttle*0.9;

        // ---------------------------------------------------------------------------------------------- Applying to throttle to escs
        // motor_power[0] = ( error_acro_roll) + ( error_acro_pitch) + ( error_acro_yaw);
        // motor_power[1] = (-error_acro_roll) + ( error_acro_pitch) + (-error_acro_yaw);
        // motor_power[2] = (-error_acro_roll) + (-error_acro_pitch) + ( error_acro_yaw);
        // motor_power[3] = ( error_acro_roll) + (-error_acro_pitch) + (-error_acro_yaw);

        motor_power[0] = 0;
        motor_power[1] = 0;
        motor_power[2] = 0;
        motor_power[3] = 0;

        // For throttle control logic

        float throttle_value = error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[0] += throttle_value;
        motor_power[1] += throttle_value;
        motor_power[2] += throttle_value;
        motor_power[3] += throttle_value;

        // For logging throttle value
        PID_set_points[3] = setServoActivationPercent(throttle_value, actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);

        throttle_value_FR = setServoActivationPercent(motor_power[2], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);
        throttle_value_FL = setServoActivationPercent(motor_power[3], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);
        throttle_value_BL = setServoActivationPercent(motor_power[0], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);
        throttle_value_BR = setServoActivationPercent(motor_power[1], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);


        
        // FPV cam side FRONT
        bdshot600_dma_set_throttle(throttle_value_FR, motor_FR); // Front-right
        bdshot600_dma_set_throttle(throttle_value_FL, motor_FL); // Front-left
        // GPS side BACK
        bdshot600_dma_set_throttle(throttle_value_BL, motor_BL); // Back-left
        bdshot600_dma_set_throttle(throttle_value_BR, motor_BR); // Back-right

        // For logging
        motor_power[0] = throttle_value_BL; // Logging BL <- BL
        motor_power[1] = throttle_value_FL; // Logging FL <- FL
        motor_power[2] = throttle_value_BR; // Logging BR <- BR
        motor_power[3] = throttle_value_FR; // Logging FR <- FR

        motor6 = DWT->CYCCNT;

        // printf("g\n");
    }else{
        // printf("b\n");
        throttle_value_FR = min_dshot600_throttle_value;
        throttle_value_FL = min_dshot600_throttle_value;
        throttle_value_BL = min_dshot600_throttle_value;
        throttle_value_BR = min_dshot600_throttle_value;

        // FPV cam side FRONT
        bdshot600_dma_set_throttle(throttle_value_FR, motor_FR); // Front-right
        bdshot600_dma_set_throttle(throttle_value_FL, motor_FL); // Front-left
        // GPS side BACK
        bdshot600_dma_set_throttle(throttle_value_BL, motor_BL); // Back-left
        bdshot600_dma_set_throttle(throttle_value_BR, motor_BR); // Back-right

        // For logging
        motor_power[0] = throttle_value_BL; // Logging
        motor_power[1] = throttle_value_FL; // Logging
        motor_power[2] = throttle_value_BR; // Logging
        motor_power[3] = throttle_value_FR; // Logging

        // Reset the remote control set points also
        remote_control[0] = 0;
        remote_control[1] = 0;
        remote_control[2] = 0;
        remote_control[3] = 0;

        PID_proportional[0] = 0; // Logging
        PID_proportional[1] = 0; // Logging
        PID_proportional[2] = 0; // Logging

        PID_integral[0] = 0; // Logging
        PID_integral[1] = 0; // Logging
        PID_integral[2] = 0; // Logging

        PID_derivative[0] = 0; // Logging
        PID_derivative[1] = 0; // Logging

