Rokasbarasa1/STM32-Quadcopter/src/main.c
    // Yaw filtering 
    filter_gyro_z = filtering_init_low_pass_filter_pt1(filter_gyro_z_yaw_cutoff_frequency, REFRESH_RATE_HZ);


    filter_motor_0 = filtering_init_low_pass_filter_pt1(motor_low_pass_filter_cutoff, REFRESH_RATE_HZ);
    filter_motor_1 = filtering_init_low_pass_filter_pt1(motor_low_pass_filter_cutoff, REFRESH_RATE_HZ);
    filter_motor_2 = filtering_init_low_pass_filter_pt1(motor_low_pass_filter_cutoff, REFRESH_RATE_HZ);
    filter_motor_3 = filtering_init_low_pass_filter_pt1(motor_low_pass_filter_cutoff, REFRESH_RATE_HZ);

    // RPM filter
    // Width does not matter and frequency will be set later using data from motors
    gyro_x_notch_filter_harmonic_1_motor_0 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_1, REFRESH_RATE_HZ);
    gyro_x_notch_filter_harmonic_1_motor_1 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_1, REFRESH_RATE_HZ);
    gyro_x_notch_filter_harmonic_1_motor_2 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_1, REFRESH_RATE_HZ);
    gyro_x_notch_filter_harmonic_1_motor_3 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_1, REFRESH_RATE_HZ);

    gyro_y_notch_filter_harmonic_1_motor_0 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_1, REFRESH_RATE_HZ);
    gyro_y_notch_filter_harmonic_1_motor_1 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_1, REFRESH_RATE_HZ);
    gyro_y_notch_filter_harmonic_1_motor_2 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_1, REFRESH_RATE_HZ);
    gyro_y_notch_filter_harmonic_1_motor_3 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_1, REFRESH_RATE_HZ);

    
    gyro_x_notch_filter_harmonic_2_motor_0 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_2, REFRESH_RATE_HZ);
    gyro_x_notch_filter_harmonic_2_motor_1 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_2, REFRESH_RATE_HZ);
    gyro_x_notch_filter_harmonic_2_motor_2 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_2, REFRESH_RATE_HZ);
    gyro_x_notch_filter_harmonic_2_motor_3 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_2, REFRESH_RATE_HZ);

    gyro_y_notch_filter_harmonic_2_motor_0 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_2, REFRESH_RATE_HZ);
    gyro_y_notch_filter_harmonic_2_motor_1 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_2, REFRESH_RATE_HZ);
    gyro_y_notch_filter_harmonic_2_motor_2 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_2, REFRESH_RATE_HZ);
    gyro_y_notch_filter_harmonic_2_motor_3 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_2, REFRESH_RATE_HZ);


    gyro_x_notch_filter_harmonic_3_motor_0 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_3, REFRESH_RATE_HZ);
    gyro_x_notch_filter_harmonic_3_motor_1 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_3, REFRESH_RATE_HZ);
    gyro_x_notch_filter_harmonic_3_motor_2 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_3, REFRESH_RATE_HZ);
    gyro_x_notch_filter_harmonic_3_motor_3 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_3, REFRESH_RATE_HZ);

    gyro_y_notch_filter_harmonic_3_motor_0 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_3, REFRESH_RATE_HZ);
    gyro_y_notch_filter_harmonic_3_motor_1 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_3, REFRESH_RATE_HZ);
    gyro_y_notch_filter_harmonic_3_motor_2 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_3, REFRESH_RATE_HZ);
    gyro_y_notch_filter_harmonic_3_motor_3 = notch_filter_q_init(0, rpm_notch_filter_q_harmonic_3, REFRESH_RATE_HZ);

    // gyro_x_notch_filter_harmonic_1 = notch_filter_q_init(0, rpm_notch_filter_q_value, REFRESH_RATE_HZ);
    // gyro_x_notch_filter_harmonic_2 = notch_filter_q_init(0, rpm_notch_filter_q_value, REFRESH_RATE_HZ);
    // gyro_x_notch_filter_harmonic_3 = notch_filter_q_init(0, rpm_notch_filter_q_value, REFRESH_RATE_HZ);

    // gyro_y_notch_filter_harmonic_1 = notch_filter_q_init(0, rpm_notch_filter_q_value, REFRESH_RATE_HZ);
    // gyro_y_notch_filter_harmonic_2 = notch_filter_q_init(0, rpm_notch_filter_q_value, REFRESH_RATE_HZ);
    // gyro_y_notch_filter_harmonic_3 = notch_filter_q_init(0, rpm_notch_filter_q_value, REFRESH_RATE_HZ);

    // D-term biquad low-pass filter
    // This is an AOS D term tune
    // Initialize with the minimum frequency
    roll_d_term_filtering = filtering_init_low_pass_filter_biquad(d_term_filtering_min_cutoff, REFRESH_RATE_HZ);
    pitch_d_term_filtering = filtering_init_low_pass_filter_biquad(d_term_filtering_min_cutoff, REFRESH_RATE_HZ);

    float S_state[2][1] = {
        {0},
        {0}
    };

    float F_state_transition[2][2] = {
        {1, 0.005},
        {0, 1}
    };

    float P_covariance[2][2] = {
        {0, 0},
        {0, 0}
    }; 

    float B_control[2][1] = {
        {0.5 + (0.005 * 0.005)},
        {0.005}
    };

    float H_observation[1][2] = {
        {1, 0}
    };

    float Q_proccess_uncertainty[2][2] = {
        {25.0025001, 0.2500125},
        {0.2500125, 0.0025}
    };

    float R_measurement_uncertainty[1][1] = {
        {30 * 30}
    };

    altitude_and_velocity_kalman = kalman_filter_init();
    kalman_filter_set_S_state(&altitude_and_velocity_kalman, (float *)S_state, 2);
    kalman_filter_set_P_covariance(&altitude_and_velocity_kalman, (float *)P_covariance, 2, 2);
    kalman_filter_set_F_state_transition_model(&altitude_and_velocity_kalman, (float *)F_state_transition, 2, 2);
    kalman_filter_set_Q_proccess_noise_covariance(&altitude_and_velocity_kalman, (float *)Q_proccess_uncertainty, 2, 2);
    kalman_filter_set_H_observation_model(&altitude_and_velocity_kalman, (float *)H_observation, 1, 2);
    kalman_filter_set_B_external_input_control_matrix(&altitude_and_velocity_kalman, (float *)B_control, 2, 1);
    kalman_filter_set_R_observation_noise_covariance(&altitude_and_velocity_kalman, (float *)R_measurement_uncertainty, 1, 1);
    kalman_filter_configure_u_measurement_input(&altitude_and_velocity_kalman, 1);
    kalman_filter_configure_z_measurement_input(&altitude_and_velocity_kalman, 1);
    uint8_t altitude_kalman_status = kalman_filter_finish_initialization(&altitude_and_velocity_kalman);

