Rokasbarasa1/STM32-Quadcopter/src/main.c
    if(use_blackbox_logging){
        uint8_t* sd_card_buffer = sd_card_get_buffer_pointer(1);
        uint16_t betaflight_header_length = 0;
        betaflight_blackbox_wrapper_get_header(
            REFRESH_RATE_HZ,
            acro_roll_pitch_gain_p,
            acro_roll_pitch_gain_i,
            acro_roll_pitch_gain_d,
            acro_roll_pitch_gain_p,
            acro_roll_pitch_gain_i,
            acro_roll_pitch_gain_d,
            acro_yaw_gain_p,
            acro_yaw_gain_i,
            0,
            angle_roll_pitch_gain_p,
            angle_roll_pitch_gain_i,
            angle_roll_pitch_gain_d,
            filter_gyro_z_yaw_cutoff_frequency,
            25, // Integral windup
            21, // Gyro lowpass cutoff
            20, // Accelerometer lowpass cutoff
            dshot_refresh_rate,
            min_dshot600_throttle_value,
            max_dshot600_throttle_value,
            actual_min_dshot600_throttle_value,
            actual_max_dshot600_throttle_value,
            d_term_filtering_expo,
            rpm_notch_filter_q_harmonic_1,
            rpm_notch_filter_min_frequency,
            d_term_filtering_min_cutoff,
            d_term_filtering_max_cutoff,
            d_term_filtering_expo,
            &betaflight_header_length,
            sd_card_buffer,
            10000
        );
        
        sd_card_buffer_increment_index_by_amount(betaflight_header_length);

        sd_special_write_chunk_of_byte_data_no_slave_response(sd_card_get_buffer_pointer(1), betaflight_header_length);

        sd_buffer_swap();
        sd_buffer_clear_index(1); // Reset the index

        HAL_Delay(1000); // wait a bit for the logger to write the data into SD
        printf("SD logging: sent blackbox header\n");
    }
}

void handle_pre_loop_start(){
    printf("Looping\n");

    // Capture any radio messages that were sent durring the boot proccess and discard them
    for (uint8_t i = 0; i < 50; i++){
        if(nrf24_data_available(1)){
            nrf24_receive(rx_data);
        }
    }

    // Reset the timer
    __HAL_TIM_CLEAR_FLAG(&htim4, TIM_FLAG_UPDATE);
    __HAL_TIM_SET_COUNTER(&htim4, 0);
    startup_time_microseconds = get_absolute_time();
    entered_loop = 1;

    // Temperature will probably not change durring the flight
    // TODO: Needs more testing for long term stability
    temperature = bmp280_get_temperature_celsius();

}

void handle_loop_start(){
    loop_start_microseconds = __HAL_TIM_GET_COUNTER(&htim4);
    loop_start_miliseconds = HAL_GetTick();
}

uint64_t get_absolute_time(){
    // Get the current updated absolute timestamp
    return absolute_microseconds_since_start + __HAL_TIM_GET_COUNTER(&htim4);
}

#define MICROSECONDS_TO_HOURS (1.0f / 3600000000.0f) // The division is more efficient with multiplication
#define HOURS_TO_MICROSECONDS (3600000000.0f)

#define MICROSECONDS_TO_MINUTES (1.0f / 60000000.0f)
#define MINUTES_TO_MICROSECONDS (60000000.0f)

#define MICROSECONDS_TO_SECONDS (1.0f / 1000000.0f)
#define SECONDS_TO_MICROSECONDS (1000000.0f)

#define MICROSECONDS_TO_MILISECONDS (1.0f / 1000.0f)
#define MILISECONDS_TO_MICROSECONDS (1000.0f)

void handle_logging(){
    delta_time = get_absolute_time() - startup_time_microseconds; // Microseconds
    time_since_startup_hours =                  delta_time * MICROSECONDS_TO_HOURS;
    time_since_startup_minutes =               (delta_time - time_since_startup_hours * HOURS_TO_MICROSECONDS) * MICROSECONDS_TO_MINUTES;
    time_since_startup_seconds =               (delta_time - time_since_startup_hours * HOURS_TO_MICROSECONDS - time_since_startup_minutes * MINUTES_TO_MICROSECONDS) * MICROSECONDS_TO_SECONDS;
    time_since_startup_ms =                    (delta_time - time_since_startup_hours * HOURS_TO_MICROSECONDS - time_since_startup_minutes * MINUTES_TO_MICROSECONDS - time_since_startup_seconds * SECONDS_TO_MICROSECONDS) * MICROSECONDS_TO_MILISECONDS;
    time_since_startup_microseconds =           delta_time - time_since_startup_hours * HOURS_TO_MICROSECONDS - time_since_startup_minutes * MINUTES_TO_MICROSECONDS - time_since_startup_seconds * SECONDS_TO_MICROSECONDS - time_since_startup_ms * MILISECONDS_TO_MICROSECONDS;
    uint32_t time_blackbox = ((time_since_startup_hours * 60 + time_since_startup_minutes * 60) + time_since_startup_seconds) * 1000000 + time_since_startup_ms * 1000 + time_since_startup_microseconds;

    if(sd_card_initialized){
        uint16_t data_size = 0;

        if(use_blackbox_logging){
            uint16_t data_size_data = 0;
            uint8_t* sd_card_buffer = (uint8_t*)sd_card_get_buffer_pointer(1);
            betaflight_blackbox_get_encoded_data_string(
                loop_iteration,
                time_blackbox,
                PID_proportional,
                PID_integral,
                PID_derivative,
                PID_feed_forward,
                remote_control,
                PID_set_points,
                gyro_angular,
                acceleration_data,
                motor_power,
                magnetometer_data,
                motor_frequency,
                altitude,
                &data_size_data,
                sd_card_buffer
            );
            
            sd_card_buffer_increment_index_by_amount(data_size);
            
            uint16_t data_size_gps = 0;
            if(got_gps){
                uint16_t data_size_gps = 0;
                betaflight_blackbox_get_encoded_gps_string(
                    bn357_get_utc_time_raw(),
                    bn357_get_fix_quality(),
                    bn357_get_latitude_decimal_format(),
                    bn357_get_longitude_decimal_format(),
                    &data_size_gps, // it will append but not overwrite
                    sd_card_buffer + sd_buffer_size(1) // Offset the buffer, to not overwrite the data
                );
                sd_card_buffer_increment_index_by_amount(data_size);
            }
            data_size = data_size_data + data_size_gps;
        }else{
            // TXT based logging
            // Log a bit of data
            // sd_card_append_to_buffer(1, "%02d:%02d:%02d:%03d;", time_since_startup_hours, time_since_startup_minutes, time_since_startup_seconds, time_since_startup_ms);
            // sd_card_append_to_buffer(1, "ACCEL,%.2f,%.2f,%.2f;", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
            // sd_card_append_to_buffer(1, "GYRO,%.2f,%.2f,%.2f;", imu_orientation[0], imu_orientation[1], imu_orientation[2]);
            // sd_card_append_to_buffer(1, "MAG,%.2f,%.2f,%.2f;", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
            // sd_card_append_to_buffer(1, "MOTOR,1=%.2f,2=%.2f,3=%.2f,4=%.2f;", motor_power[0], motor_power[1], motor_power[2], motor_power[3]);
            // sd_card_append_to_buffer(1, "ERROR,pitch=%.2f,roll=%.2f,yaw=%.2f,altitude=%.2f;", error_angle_pitch, error_angle_roll, error_acro_yaw, error_altitude);
            // sd_card_append_to_buffer(1, "TEMP,%.2f;", temperature);
            // sd_card_append_to_buffer(1, "ALT %.2f;", altitude);
            // sd_card_append_to_buffer(1, "GPS,lon-%f,lat-%f;", bn357_get_longitude_decimal_format(), bn357_get_latitude_decimal_format());
            // sd_card_append_to_buffer(1, "\n");

